app/views/reservations/new.html.erb

        <p><h3>Select car</h3>
        <%= f.collection_select(:car_id,Car.all,:id,:car_number_name) %></p>
        <p><h3>Select user</h3>
        <%= f.collection_select(:user_id,User.where("role='Customer'"),:id, :name ) %></p>
---
SELECT "cars".* FROM "cars"
SELECT "users".* FROM "users" WHERE (role='Customer')