app/controllers/cars_controller.rb

  def index
    @search = Car.ransack(params[:q])
    @cars = @search.result(distinct: true).where(["status = :status", {status: 'Approved'}])
---
SELECT DISTINCT Manufacturer FROM "cars" WHERE (status = 'Approved')

  def carsforapproval
    @cars = Car.where(["status = :status", {status: 'Unapproved'}])
---
SELECT "cars".* FROM "cars" WHERE (status = 'Unapproved')

  def create
    @car= Car.new(car_params)
    if @car.save
---
INSERT INTO "cars" ("manufacturer", "model", "style", "hourly_rate", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @car = Car.find(params[:id])
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]

  def destroy
    @car = Car.find(params[:id])
    unless Reservation.where("(? = car_id) AND (? = current)", @car.id, true).count == 0
      redirect_to '/cars'
      flash[:notice] = "#{@car.car_number_name} The car has been reserved or checked out"
      else
    @car.destroy
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "reservations" WHERE ((25 = car_id) AND ('t' = current))
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 4]]
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 8]]