app/controllers/reservations_controller.rb

  def create
    @reservation = Reservation.new(reservation_params)
    if @reservation.save
---
INSERT INTO "reservations" ("start_time", "end_time", "user_id", "car_id", "Status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def reservationlog
      @reservations= Reservation.where("current = :current", {current: false})
---
SELECT "reservations".* FROM "reservations" WHERE (current = 'f')

    def customercurrentreservation
      @custreservations= Reservation.where("current = :current and user_id = :user_id", {current: true, user_id: current_user.id })
---
SELECT "reservations".* FROM "reservations" WHERE (current = 't' and user_id = 21)

  def currentreservations
      @reservations = Reservation.where("current = :current", {current: true})
---
SELECT "reservations".* FROM "reservations" WHERE (Status = 0 and Current = 1 and user_id = 4)

    def customerhistory
      @custreservations = Reservation.where("user_id = :user_id and current = :current", {user_id: current_user.id, current: false})
---
SELECT "reservations".* FROM "reservations" WHERE (user_id = 21 and current = 'f')

  def checkout
    @reservation = Reservation.find(params[:id])
    @reservation.update_attribute(:status, true)
    @reservation.update_attribute(:current, true)
    @reservation.update_attribute(:start_time, DateTime.now)
    @reservation.car.update_attribute(:carstatus, 'Checked out')
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reservations" SET "start_time" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["start_time", "2017-10-05 07:44:20.742510"], ["updated_at", "2017-10-05 07:44:20.744555"], ["id", 6]]
UPDATE "cars" SET "carstatus" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["carstatus", "Checked out"], ["updated_at", "2017-10-05 07:44:20.902087"], ["id", 25]]

  def cancel
    @reservation = Reservation.find(params[:id])
    @reservation.update_attribute(:current, false)
    @reservation.car.update_attribute(:carstatus, 'Available')
    if current_user.role == 'Customer'
      @notifiers = Notifier.where("car_id = :car_id and status = :status", {car_id: @reservation.car_id, status: true})
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "reservations" SET "current" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["current", "f"], ["updated_at", "2017-10-06 10:48:34.028498"], ["id", 11]]
UPDATE "cars" SET "carstatus" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["carstatus", "Available"], ["updated_at", "2017-10-06 10:48:34.119743"], ["id", 34]]
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]

  def checkin
    @reservation = Reservation.find(params[:id])
    @reservation.update_attribute(:current, 0)
    @reservation.update_attribute(:end_time, DateTime.now)
    @reservation.car.update_attribute(:carstatus, 'Available')
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reservations" SET "end_time" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["end_time", "2017-09-27 14:15:32.115748"], ["updated_at", "2017-09-27 14:15:32.120752"], ["id", 1]]
UPDATE "cars" SET "carstatus" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["carstatus", "Available"], ["updated_at", "2017-10-05 10:45:16.356394"], ["id", 25]]

  def viewreservations
    @user = User.find(params[:user_id])
    @reservations = Reservation.where("user_id = :user_id", {user_id: @user.id})
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE (user_id = 21)