app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (role = 'Customer')
---
  def indexcustomers
    @users = User.where(["role = :role", {role: 'Customer' }])

SELECT "users".* FROM "users" WHERE (role = 'Admin')
---
  def indexadmin
    @users = User.where(["role = :role", {role: 'Admin' }])

SELECT "users".* FROM "users" WHERE (role = 'Super admin')
---
  def indexsuperadmin
    @users = User.where(["role = :role", {role: 'Super admin' }])

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "address", "age", "license_number", "credit_card_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
      if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", "Admin"], ["updated_at", "2017-09-26 20:27:49.001258"], ["id", 5]]
---
  def makeadmin
    @user = User.find(params[:id])
    @user.update_attribute(:role, 'Admin')

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", "Super admin"], ["updated_at", "2017-09-26 21:09:57.966115"], ["id", 5]]
---
  def makesuperadmin
    @user = User.find(params[:id])
    @user.update_attribute(:role, 'Super admin')

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "reservations" WHERE (user_id = 16, current = 't', status = 't')
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 4]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]
---
  def destroy
    @user = User.find(params[:id])
    role = @user.role
    unless Reservation.where("(? = user_id) AND (? = current)", @user.id, true).count == 0
      redirect_to '/indexcustomers'
      flash[:notice] = "The customer has taken out a car or reserved a car"
    else
    @user.destroy