app/views/cars/index.html.erb

SELECT DISTINCT "cars".* FROM "cars" WHERE ("cars"."manufacturer" LIKE '%BMW%') AND (status = 'Approved')
---
<<<<<<< HEAD
    <p>Manufacturer: <%= f.collection_select :manufacturer_cont, Car.select("Manufacturer").where(["status = :status", {status: 'Approved'}]).uniq, :manufacturer, :manufacturer, {:include_blank => "Please select manufacturer"} %></p>

SELECT Manufacturer FROM "cars"
---
    <p>Status: <%= f.collection_select :carstatus_cont, Car.select("Carstatus").where(["status = :status", {status: 'Approved'}]).uniq, :carstatus, :carstatus, {:include_blank => "Please select car status"} %></p>
=======
    <p>Manufacturer: <%= f.collection_select :manufacturer_cont, Car.select("Manufacturer").uniq, :manufacturer, :manufacturer, {:include_blank => "Please select manufacturer"} %></p>